scr1c/Catalogs/ТСЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТСЗаказчика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>индексГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

scr1c/Catalogs/ТСЗаказчика/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	код = Справочники.ТСЗаказчика.фрмГосНомер(код); 
	
	
	Рез="";
	Для а=1 по СтрДлина(код) Цикл
		п = Сред(код,а,1);
		Если п>="0" и п<="9" Тогда
			рез=рез+п;
		ИНачеЕсли Рез<>"" Тогда
				прервать;
		КонецЕслИ;
				
	Конеццикла;
	
	индексГосНомер = рез;  
	
	Если ЗначениеЗаполнено(Номенклатура)=Ложь Тогда
		Номенклатура = Константы.ОсновнаяНоменклатура.Получить();
	КонецеслИ;
	
	Если Активен Тогда
		ПроверкаАктивногоДубля();	
	КонецеслИ;
	
	
КонецПроцедуры  

Функция ПроверкаАктивногоДубля()
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Код",Код);
	Запрос.УстановитьПараметр("Ссылка",ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТСЗаказчика.Ссылка КАК Ссылка,
	               |	ТСЗаказчика.Владелец КАК Владелец
	               |ИЗ
	               |	Справочник.ТСЗаказчика КАК ТСЗаказчика
	               |ГДЕ
	               |	ТСЗаказчика.Код = &Код
	               |	И ТСЗаказчика.Активен = TRUE
	               |	И ТСЗаказчика.Ссылка <> &Ссылка";
	
	Выб = Запрос.Выполнить().Выбрать();
	рез="";
	Пока Выб.Следующий() Цикл
		рез = рез+"--- Автомобиль с гос.номером "+Код+" используется у контрагента "+выб.Владелец+" ";
	КонецЦикла;  
	
	Если рез<>"" Тогда
		ВызватьИсключение рез;
	Конецесли;
	
	Возврат Рез;
	
КонецФункции
